import write_mysql
import pandas as pd

sql_query= "select * from production_schedule"
# df= pd.read_sql(sql_query,write_mysql.engine())



columns= ['id','生产日期','班次', '重点关注', '任务单号', '客户', '型号', '产品名称', '宽度', '长度', '涂布辊', '产能',
       '计划时间', '卷数', '计划米数', '订单交期', '订单数', '物料信息', '实际米数', '报废米数', '异常报废',
       '报废率', '实际生产时间', '平方数', '实际平方', '原膜批号', '生产批号', '机速', '剥离剂', 'F02',
       '7475胶带粘性', '涂布量1', '涂布量2', '涂布量3', '急测', '首件离型力1', '首件离型力2', '首件离型力3',
       '尾件离型力1', '尾件离型力2', '尾件离型力3', '熟化12H离型力1', '熟化13H离型力2', '熟化14H离型力3',
       '防静电值1', '防静电值2', '防静电值3', '常温24H离型力1', '常温24H离型力2', '常温24H离型力3',
       '烘烤70℃离型力1', '烘烤70℃离型力2', '烘烤70℃离型力3', '残率1', '残率2', '残率3', '原膜检查',
       '电晕值52达因', '电晕处理', '烘箱温度1', '烘箱温度2', '烘箱温度3', '烘箱温度4', '烘箱温度5', '烘箱温度6',
       '是否掉硅', '涂布问题描述', '正/反放卷', '涂头温度', '涂头湿度%', 'QC签名', '装刀距离', '速比', '气压',
       '一放张力', '放牵张力', '出牵张力', '收卷张力', '收卷锥度', '烘道张力', '生产领班', '备注']

df= pd.read_sql(sql_query,write_mysql.engine())

# print(df)

# df= df.to_dict(orient='records')

for index, row in df.iterrows():
    print(f"第 {index + 1} 行:")
    for column, value in row.items():
        print(f"  {column}: {value}")